Revit 2024 API
RebarPropagation Class
 An utility class containing functions that can be used to propagate rebar elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static class RebarPropagation
Visual Basic
Public NotInheritable Class RebarPropagation
Visual C++
public ref class RebarPropagation abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarPropagation
See Also
RebarPropagation Members
Autodesk.Revit.DB.Structure Namespace